{"meta":{"title":"LiXuan's blog","subtitle":"Deeplearning|MachineLearning|ComputerVision","description":"Deeplearning|MachineLearning|ComputerVision","author":"leexuan","url":"http://yoursite.com"},"pages":[{"title":"404","date":"2018-10-24T07:55:18.000Z","updated":"2018-10-24T07:55:18.744Z","comments":true,"path":"404/index.html","permalink":"http://yoursite.com/404/index.html","excerpt":"","text":""},{"title":"Wode \"Nimo\" Ni","date":"2019-01-04T08:55:23.100Z","updated":"2019-01-04T08:49:35.972Z","comments":true,"path":"about/index.html","permalink":"http://yoursite.com/about/index.html","excerpt":"","text":"Wode Nics.cmu.edu/~wodenwoden@cs.cmu.edu EducationCarnegie Mellon University 2018.9 -1Pittsburgh, PA Ph.D. in Software Engineering Co-advised by Ken Koedinger and Josh Sunshine Columbia University 2016.9 - 2018.51New York, NY B.S. in Computer Science, Magna Cum Laude Vision, Graphics track Dickinson College 2013.9 - 2016.51Carlisle, PA B.S. in Computer Science, Summa Cum Laude Computer Science Departmental Honors PublicationsSubstance and Style: domain-specific languages for mathematical diagramsWode Ni*, Katherine Ye*, Joshua Sunshine, Jonathan Aldrich, and Keenan Crane. Domain-Specific Language Design and Implementation (DSLDI 2017), co-located with SPLASH. [PDF][slides][www][repo] Whiteboard Scanning Using Super-ResolutionWode Ni. Dickinson College Honors Theses. Paper 221.[PDF] ExperienceCarnegie Mellon University, Research Experiences for Undergraduate 2017.5 - 2017.8Research AssistantPenrose is a system that automatically visualizes mathematics using two domain-specific languages: Substance and Style. Co-advised by Jonathan Aldrich, Keenan Crane, Joshua Sunshine, and Katherine Ye, I designed and implemented the Style language, and extended the Substance language to support functions and logically quantified statements. Columbia University, Computer Graphics and User Interfaces Lab 2017.1 - 2017.5Research AssistantWorked with prof. Steven Feiner, on Cyber Affordance Visualization in Augumented Reality project. Developed a Microsoft Hololens application that visualizes the Columbia campus in AR environment. AsiaInfo 2015.6 - 2015.8Software Engineering InternWorked on server-side web applications and server deployment tools. TeachingTeaching Assistant, Programming Languages and Translators (COMS 4115) Columbia, 2017 - 2018 Teaching Assistant, Introduction to Java II (COMP 132) Dickinson, 2016 Peer Tutor, Data Structures and Problem Solving (COMP 232) Dickinson, 2016 Computer Lab Consultant Dickinson, 2014 - 2016 Honors &amp; AwardsPhi Beta Kappa Dickinson, 2018 Excellence in Computer Science Award Columbia, 2018 Tau Beta Pi, Engineering Honor Society Columbia, 2017 Computer Science Departmental Honors Dickinson, 2016 Pi Mu Epsilon, Mathematics Honor Society Dickinson, 2016 Upsilon Pi Epsilon, Computer Science Honor Society Dickinson, 2016 Alpha Lambda Delta, First year Honor Society Dickinson, 2013John Montgomery Scholarship Dickinson, 2013"},{"title":"categories","date":"2019-01-04T08:32:33.441Z","updated":"2019-01-04T08:32:33.441Z","comments":true,"path":"categories/index.html","permalink":"http://yoursite.com/categories/index.html","excerpt":"","text":""},{"title":"search","date":"2018-10-24T07:55:10.000Z","updated":"2018-10-24T07:55:10.868Z","comments":true,"path":"search/index.html","permalink":"http://yoursite.com/search/index.html","excerpt":"","text":""},{"title":"tags","date":"2019-01-04T08:25:56.849Z","updated":"2019-01-04T08:25:56.849Z","comments":true,"path":"tags/index.html","permalink":"http://yoursite.com/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"Hello World","slug":"hello-world","date":"2018-10-24T07:44:41.109Z","updated":"2018-10-24T07:44:41.109Z","comments":true,"path":"2018/10/24/hello-world/","link":"","permalink":"http://yoursite.com/2018/10/24/hello-world/","excerpt":"","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","categories":[],"tags":[]}]}